{
  "posts": [
    { "id": 1, "title": "Post 1" },
    { "id": 2, "title": "Post 2" },
    { "id": 3, "title": "Post 3" }
  ],
  "comments": [
    { "id": 1, "body": "some comment", "postId": 1 },
    { "id": 2, "body": "some comment", "postId": 1 }
  ],
  "profile": {
    "name": "Kanade_san"
  },
  "books": [
  {"id":1, "title": "Notes From Underground","author":"Fyodor Dostoyevsky", "description": "Dostoevsky’s most revolutionary novel, Notes from Underground marks the dividing line between nineteenth- and twentieth-century fiction, and between the visions of self each century embodied. One of the most remarkable characters in literature, the unnamed narrator is a former official who has defiantly withdrawn into an underground existence. In complete retreat from society, he scrawls a passionate, obsessive, self-contradictory narrative that serves as a devastating attack on social utopianism and an assertion of man’s essentially irrational nature. ", "img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327909683l/49455.jpg"}, 
  {"id":2, "title": "The Metamorphosis","author":"Franz Kafka", "description":"As Gregor Samsa awoke one morning from uneasy dreams he found himself transformed in his bed into a gigantic insect. He was laying on his hard, as it were armor-plated, back and when he lifted his head a little he could see his domelike brown belly divided into stiff arched segments on top of which the bed quilt could hardly keep in position and was about to slide off completely. His numerous legs, which were pitifully thin compared to the rest of his bulk, waved helplessly before his eyes.With it's startling, bizarre, yet surprisingly funny first opening, Kafka begins his masterpiece, The Metamorphosis. It is the story of a young man who, transformed overnight into a giant beetle-like insect, becomes an object of disgrace to his family, an outsider in his own home, a quintessentially alienated man. A harrowing—though absurdly comic—meditation on human feelings of inadequacy, guilt, and isolation, The Metamorphosis has taken its place as one of the most widely read and influential works of twentieth-century fiction. As W.H. Auden wrote, Kafka is important to us because his predicament is the predicament of modern man.", "img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1359061917l/485894.jpg"},
  {"id":3, "title": "Animal Farm", "author":"George Orwell", "description": "A farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. Thus the stage is set for one of the most telling satiric fables ever penned –a razor-edged fairy tale for grown-ups that records the evolution from revolution against tyranny to a totalitarianism just as terrible. When Animal Farm was first published, Stalinist Russia was seen as its target. Today it is devastatingly clear that wherever and whenever freedom is attacked, under whatever banner, the cutting clarity and savage comedy of George Orwell’s masterpiece have a meaning and message still ferociously fresh.", "img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1325861570l/170448.jpg"},
  {"id":4, "title": "To Kill A MockingBird", "author":"Harper Lee", "description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic. Compassionate, dramatic, and deeply moving, To Kill A Mockingbird takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.","img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1553383690l/2657.jpg"},
  {"id":5, "title": "Thus Spoke Zarathustra", "author":"Frederic Nietzsche","description": "Thus Spoke Zarathustra is a foundational work of Western literature and is widely considered to be Friedrich Nietzsche’s masterpiece. It includes the German philosopher’s famous discussion of the phrase ‘God is dead’ as well as his concept of the Superman. Nietzsche delineates his Will to Power theory and devotes pages to critiquing Christian thinking, in particular Christianity’s definition of good and evil.","img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1480901846l/51893.jpg"},
  {"id":6, "title": "The Brother Karamazov","author":"Fyodor Dostoyevsky", "description": "The Brothers Karamazov is a murder mystery, a courtroom drama, and an exploration of erotic rivalry in a series of triangular love affairs involving the “wicked and sentimental” Fyodor Pavlovich Karamazov and his three sons―the impulsive and sensual Dmitri; the coldly rational Ivan; and the healthy, red-cheeked young novice Alyosha. Through the gripping events of their story, Dostoevsky portrays the whole of Russian life, is social and spiritual striving, in what was both the golden age and a tragic turning point in Russian culture.","img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1427728126l/4934.jpg"},
  {"id":7, "title": "Crime And Punishment","author":"Fyodor Dostoyevsky", "description": "description": "Raskolnikov, a destitute and desperate former student, wanders through the slums of St Petersburg and commits a random murder without remorse or regret. He imagines himself to be a great man, a Napoleon: acting for a higher purpose beyond conventional moral law. But as he embarks on a dangerous game of cat and mouse with a suspicious police investigator, Raskolnikov is pursued by the growing voice of his conscience and finds the noose of his own guilt tightening around his neck. Only Sonya, a downtrodden prostitute, can offer the chance of redemption.","img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1382846449l/7144.jpg"},
  {"id":8, "title": "Selfish Gene", "author":"Ricard Dawnkin","description": "Inheriting the mantle of revolutionary biologist from Darwin, Watson, and Crick, Richard Dawkins forced an enormous change in the way we see ourselves and the world with the publication of The Selfish Gene. Suppose, instead of thinking about organisms using genes to reproduce themselves, as we had since Mendel's work was rediscovered, we turn it around and imagine that "our" genes build and maintain us in order to make more genes. That simple reversal seems to answer many puzzlers which had stumped scientists for years, and we haven't thought of evolution in the same way since.","img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1366758096l/61535.jpg"},
  {"id":9, "title": "Within Reason","author":"Donald B. Calne","description": "Buku ini membahas mengenai nalar (reason) dan pengaruhnya pada kehidupan manusia. Seperti apakah nalar itu, darimana asalnya, apa yang bisa dan tidak bisa dilakukannya. Mengenai bagaimana otak memberi manusia akal budi (minds) guna menciptakan konsep-konsep tentang ruang, waktu, dan hubungan sebab akibat, serta bagaimana semua itu, bersama daya ingat, memungkinkan manusia membangun kemampuan nalar.","img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1378709036l/9669060.jpg"},
  {"id":10, "title": "Civilization and Its Discontents","author":"Sigmund Freud","description": "Civilization and Its Discontents is one of the last of Freud's books, written in the decade before his death and first published in German in 1929. In it he states his views on the broad question of man's place in the world, a place Freud defines in terms of ceaseless conflict between the individual's quest for freedom and society's demand for conformity.","img_src":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1438544596l/357636._SY475_.jpg"}
  ]
}
